Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 512, 512, 4) 0
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 256, 256, 64) 4160        input_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 256, 256, 64) 0           conv2d[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 128, 128, 128 131200      leaky_re_lu[0][0]
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 128, 128, 128 0           conv2d_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 64, 64, 256)  524544      leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 64, 64, 256)  0           conv2d_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 512)  2097664     leaky_re_lu_2[0][0]
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 32, 32, 512)  0           conv2d_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 16, 16, 512)  4194816     leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 16, 16, 512)  0           conv2d_4[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 8, 8, 512)    4194816     leaky_re_lu_4[0][0]
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 8, 8, 512)    0           conv2d_5[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 4, 4, 512)    4194816     leaky_re_lu_5[0][0]
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 4, 4, 512)    0           conv2d_6[0][0]
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 8, 8, 512)    0           leaky_re_lu_6[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 8, 8, 512)    4194816     up_sampling2d[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 8, 8, 512)    2048        conv2d_7[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 8, 8, 1024)   0           batch_normalization[0][0]
                                                                 leaky_re_lu_5[0][0]
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 16, 16, 1024) 0           concatenate[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 512)  8389120     up_sampling2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 16, 16, 512)  2048        conv2d_8[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 16, 16, 1024) 0           batch_normalization_1[0][0]
                                                                 leaky_re_lu_4[0][0]
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 32, 32, 1024) 0           concatenate_1[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 512)  8389120     up_sampling2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 512)  2048        conv2d_9[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 32, 32, 1024) 0           batch_normalization_2[0][0]
                                                                 leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 64, 64, 1024) 0           concatenate_2[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 64, 64, 256)  4194560     up_sampling2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 64, 64, 256)  1024        conv2d_10[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 64, 64, 512)  0           batch_normalization_3[0][0]
                                                                 leaky_re_lu_2[0][0]
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 128, 128, 512 0           concatenate_3[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 128, 128, 128 1048704     up_sampling2d_4[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128, 128, 128 512         conv2d_11[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 128, 128, 256 0           batch_normalization_4[0][0]
                                                                 leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 256, 256, 256 0           concatenate_4[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 256, 256, 64) 262208      up_sampling2d_5[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 256, 256, 64) 256         conv2d_12[0][0]
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 256, 256, 128 0           batch_normalization_5[0][0]
                                                                 leaky_re_lu[0][0]
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, 512, 512, 128 0           concatenate_5[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 512, 512, 1)  2049        up_sampling2d_6[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 256, 256, 1)  2049        concatenate_5[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 128, 128, 1)  4097        concatenate_4[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 64, 64, 1)    8193        concatenate_3[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 32, 32, 1)    16385       concatenate_2[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 16, 16, 1)    16385       concatenate_1[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 8, 8, 1)      16385       concatenate[0][0]
==================================================================================================
Total params: 41,894,023
Trainable params: 41,890,055
Non-trainable params: 3,968
__________________________________________________________________________________________________
