__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 512, 512, 1)  0
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 514, 514, 16) 160         input_1[0][0]
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 516, 516, 16) 416         input_1[0][0]
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 518, 518, 16) 800         input_1[0][0]
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 520, 520, 16) 1312        input_1[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 514, 514, 16) 64          conv2d_transpose_1[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 516, 516, 16) 64          conv2d_transpose_2[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 518, 518, 16) 64          conv2d_transpose_3[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 520, 520, 16) 64          conv2d_transpose_4[0][0]
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 514, 514, 16) 0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 516, 516, 16) 0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 518, 518, 16) 0           batch_normalization_5[0][0]
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 520, 520, 16) 0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 512, 16) 2320        leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 512, 512, 16) 6416        leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 512, 512, 16) 12560       leaky_re_lu_5[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 512, 512, 16) 20752       leaky_re_lu_7[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 512, 512, 16) 64          conv2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 512, 512, 16) 64          conv2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 512, 512, 16) 64          conv2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 512, 512, 16) 64          conv2d_4[0][0]
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 512, 512, 16) 0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 512, 512, 16) 0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 512, 512, 16) 0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 512, 512, 16) 0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 512, 512, 64) 0           leaky_re_lu_2[0][0]
                                                                 leaky_re_lu_4[0][0]
                                                                 leaky_re_lu_6[0][0]
                                                                 leaky_re_lu_8[0][0]
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 256, 256, 64) 0           concatenate_1[0][0]
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 258, 258, 32) 18464       average_pooling2d_1[0][0]
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 260, 260, 32) 51232       average_pooling2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 258, 258, 32) 128         conv2d_transpose_5[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 260, 260, 32) 128         conv2d_transpose_6[0][0]
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 258, 258, 32) 0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 260, 260, 32) 0           batch_normalization_11[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 256, 256, 32) 9248        leaky_re_lu_9[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 256, 256, 32) 25632       leaky_re_lu_11[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 256, 256, 32) 128         conv2d_5[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 256, 256, 32) 128         conv2d_6[0][0]
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 256, 256, 32) 0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 256, 256, 32) 0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 256, 256, 64) 0           leaky_re_lu_10[0][0]
                                                                 leaky_re_lu_12[0][0]
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 128, 128, 64) 0           concatenate_2[0][0]
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 130, 130, 32) 18464       average_pooling2d_2[0][0]
__________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTrans (None, 132, 132, 32) 51232       average_pooling2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 130, 130, 32) 128         conv2d_transpose_7[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 132, 132, 32) 128         conv2d_transpose_8[0][0]
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 130, 130, 32) 0           batch_normalization_13[0][0]
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 132, 132, 32) 0           batch_normalization_15[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 32) 9248        leaky_re_lu_13[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 128, 128, 32) 25632       leaky_re_lu_15[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 128, 128, 32) 128         conv2d_7[0][0]
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 128, 128, 32) 128         conv2d_8[0][0]
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 128, 128, 32) 0           batch_normalization_14[0][0]
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 128, 128, 32) 0           batch_normalization_16[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 128, 128, 64) 0           leaky_re_lu_14[0][0]
                                                                 leaky_re_lu_16[0][0]
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 64, 64, 64)   0           concatenate_3[0][0]
__________________________________________________________________________________________________
conv2d_transpose_9 (Conv2DTrans (None, 66, 66, 32)   18464       average_pooling2d_3[0][0]
__________________________________________________________________________________________________
conv2d_transpose_10 (Conv2DTran (None, 68, 68, 32)   51232       average_pooling2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 66, 66, 32)   128         conv2d_transpose_9[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 68, 68, 32)   128         conv2d_transpose_10[0][0]
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 66, 66, 32)   0           batch_normalization_17[0][0]
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 68, 68, 32)   0           batch_normalization_19[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 64, 32)   9248        leaky_re_lu_17[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 64, 64, 32)   25632       leaky_re_lu_19[0][0]
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 64, 64, 32)   128         conv2d_9[0][0]
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 64, 64, 32)   128         conv2d_10[0][0]
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 64, 64, 32)   0           batch_normalization_18[0][0]
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 64, 64, 32)   0           batch_normalization_20[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 64, 64, 64)   0           leaky_re_lu_18[0][0]
                                                                 leaky_re_lu_20[0][0]
__________________________________________________________________________________________________
average_pooling2d_4 (AveragePoo (None, 32, 32, 64)   0           concatenate_4[0][0]
__________________________________________________________________________________________________
conv2d_transpose_11 (Conv2DTran (None, 34, 34, 64)   36928       average_pooling2d_4[0][0]
__________________________________________________________________________________________________
conv2d_transpose_12 (Conv2DTran (None, 36, 36, 64)   102464      average_pooling2d_4[0][0]
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 34, 34, 64)   256         conv2d_transpose_11[0][0]
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 36, 36, 64)   256         conv2d_transpose_12[0][0]
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 34, 34, 64)   0           batch_normalization_21[0][0]
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 36, 36, 64)   0           batch_normalization_23[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 32, 64)   36928       leaky_re_lu_21[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 32, 32, 64)   102464      leaky_re_lu_23[0][0]
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 32, 32, 64)   256         conv2d_11[0][0]
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 32, 32, 64)   256         conv2d_12[0][0]
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 32, 32, 64)   0           batch_normalization_22[0][0]
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 32, 32, 64)   0           batch_normalization_24[0][0]
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 32, 32, 128)  0           leaky_re_lu_22[0][0]
                                                                 leaky_re_lu_24[0][0]
__________________________________________________________________________________________________
average_pooling2d_5 (AveragePoo (None, 16, 16, 128)  0           concatenate_5[0][0]
__________________________________________________________________________________________________
conv2d_transpose_13 (Conv2DTran (None, 18, 18, 64)   73792       average_pooling2d_5[0][0]
__________________________________________________________________________________________________
conv2d_transpose_14 (Conv2DTran (None, 20, 20, 64)   204864      average_pooling2d_5[0][0]
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 18, 18, 64)   256         conv2d_transpose_13[0][0]
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 20, 20, 64)   256         conv2d_transpose_14[0][0]
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 18, 18, 64)   0           batch_normalization_25[0][0]
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (None, 20, 20, 64)   0           batch_normalization_27[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 64)   36928       leaky_re_lu_25[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 16, 64)   102464      leaky_re_lu_27[0][0]
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 16, 16, 64)   256         conv2d_13[0][0]
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 16, 16, 64)   256         conv2d_14[0][0]
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 16, 16, 64)   0           batch_normalization_26[0][0]
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 16, 16, 64)   0           batch_normalization_28[0][0]
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 16, 16, 128)  0           leaky_re_lu_26[0][0]
                                                                 leaky_re_lu_28[0][0]
__________________________________________________________________________________________________
average_pooling2d_6 (AveragePoo (None, 8, 8, 128)    0           concatenate_6[0][0]
__________________________________________________________________________________________________
conv2d_transpose_15 (Conv2DTran (None, 10, 10, 64)   73792       average_pooling2d_6[0][0]
__________________________________________________________________________________________________
conv2d_transpose_16 (Conv2DTran (None, 12, 12, 64)   204864      average_pooling2d_6[0][0]
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 10, 10, 64)   256         conv2d_transpose_15[0][0]
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 12, 12, 64)   256         conv2d_transpose_16[0][0]
__________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)      (None, 10, 10, 64)   0           batch_normalization_29[0][0]
__________________________________________________________________________________________________
leaky_re_lu_31 (LeakyReLU)      (None, 12, 12, 64)   0           batch_normalization_31[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 8, 8, 64)     36928       leaky_re_lu_29[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 8, 8, 64)     102464      leaky_re_lu_31[0][0]
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 8, 8, 64)     256         conv2d_15[0][0]
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 8, 8, 64)     256         conv2d_16[0][0]
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (None, 8, 8, 64)     0           batch_normalization_30[0][0]
__________________________________________________________________________________________________
leaky_re_lu_32 (LeakyReLU)      (None, 8, 8, 64)     0           batch_normalization_32[0][0]
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 8, 8, 128)    0           leaky_re_lu_30[0][0]
                                                                 leaky_re_lu_32[0][0]
__________________________________________________________________________________________________
conv2d_transpose_17 (Conv2DTran (None, 34, 34, 64)   73792       concatenate_5[0][0]
__________________________________________________________________________________________________
conv2d_transpose_18 (Conv2DTran (None, 18, 18, 64)   73792       concatenate_6[0][0]
__________________________________________________________________________________________________
conv2d_transpose_19 (Conv2DTran (None, 10, 10, 64)   73792       concatenate_7[0][0]
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 34, 34, 64)   256         conv2d_transpose_17[0][0]
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 18, 18, 64)   256         conv2d_transpose_18[0][0]
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 10, 10, 64)   256         conv2d_transpose_19[0][0]
__________________________________________________________________________________________________
leaky_re_lu_33 (LeakyReLU)      (None, 34, 34, 64)   0           batch_normalization_33[0][0]
__________________________________________________________________________________________________
leaky_re_lu_34 (LeakyReLU)      (None, 18, 18, 64)   0           batch_normalization_34[0][0]
__________________________________________________________________________________________________
leaky_re_lu_35 (LeakyReLU)      (None, 10, 10, 64)   0           batch_normalization_35[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 32, 32, 1)    577         leaky_re_lu_33[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 16, 16, 1)    577         leaky_re_lu_34[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 8, 8, 1)      577         leaky_re_lu_35[0][0]
==================================================================================================
Total params: 1,702,339
Trainable params: 1,699,395
Non-trainable params: 2,944
__________________________________________________________________________________________________
