Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 512, 512, 1) 0                                            
__________________________________________________________________________________________________
uniform_5 (Conv2D)              (None, 512, 512, 1)  25          input_1[0][0]                    
__________________________________________________________________________________________________
uniform_7 (Conv2D)              (None, 512, 512, 1)  49          input_1[0][0]                    
__________________________________________________________________________________________________
gaussian_20 (Conv2D)            (None, 512, 512, 1)  1089        input_1[0][0]                    
__________________________________________________________________________________________________
gaussian_30 (Conv2D)            (None, 512, 512, 1)  1089        input_1[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 512, 512, 4)  0           uniform_5[0][0]                  
                                                                 uniform_7[0][0]                  
                                                                 gaussian_20[0][0]                
                                                                 gaussian_30[0][0]                
==================================================================================================
Total params: 2,252
Trainable params: 0
Non-trainable params: 2,252
__________________________________________________________________________________________________
